#include <iostream>
#include "Lab3Expaple.h"

using namespace std;

int main(){
    int n = 0;
    system("chcp 1251");
    system("cls");

    cout << " Lab #3  !!!\n\n";

    cout << " ============================================================== 1 ============================================================== \n";
    cout << " Створити клас типу – прямокутник ( поля : висота, ширина, колір). У класі визначити: \n";
    cout << " - конструктори ( не менше двох); \n";
    cout << " - функції-члени обчислення площі, периметру;  \n";
    cout << " - функції-члени встановлення висоти, ширини, кольору, функції встановлення полів класу повинні перевіряти коректність \n";
    cout << " параметрів, що задаються; \n";
    cout << " - функції-члени що повертають значення полів; \n";
    cout << " - функцію друку; \n";
    cout << " Написати програму тестування всіх можливостей цього класу. \n\n";
    cout << " ============================================================== 2 ============================================================== \n";
    cout << " Створити тип даних - клас вектор, який має вказівник на double, число елементів і змінну стану.У класі визначити  \n";
    cout << " - конструктор без параметрів (виділяє місце для одного елемента та інінціалізує його в нуль); \n";
    cout << " - конструктор з одним параметром - розмір вектора( виділяє місце та інінціалізує масив значенням нуль); \n";
    cout << " - конструктор із двома параметрами - розмір вектора та значення ініціалізації(виділяє місце(значення перший аргумент) \n";
    cout << " та інінціалізує значенням другого аргументу); \n";
    cout << " - конструктор копій та операцію присвоєння; !!! \n";
    cout << " - деструктор звільняє пам'ять; \n";
    cout << " - визначити функцію, яка присвоює елементу масиву деяке значення (параметр зазамовчуванням); \n";
    cout << " - функцію яка одержує деякий елемент масиву; \n";
    cout << " - визначити функції друку, додавання, віднімання, які здійснюють ці арифметичні операції з даними цього класу, множення та ділення \n";
    cout << " на скаляр та ділення на скаляр типу double; \n";
    cout << " - визначити функції порівняння: більше, менше або рівно, які повертають true або false.\n";
    cout << " У змінну стани встановлювати код помилки, коли не вистачає пам'яті, виходить за межі масиву. Передбачити можливість \n";
    cout << " підрахунку числа об'єктів даного типу. Написати програму тестування всіх можливостей цього класу. \n\n";
    cout << " ============================================================== 3 ============================================================== \n";
    cout << " Створити клас матриця. Даний клас містить вказівник на double, розміри рядків і стовпців та стан помилки.У класі визначити   \n";
    cout << " - конструктор без параметрів( виділяє місце для матриці 4 на 3 елемента та інінціалізує його в нуль); \n";
    cout << " - конструктор з одним параметром - розмір n матриці (виділяє місце для матриці n на n та інінціалізує матрицю значенням нуль); \n";
    cout << " - конструктор із трьома розміри матриці (n , m) та значення ініціалізації value (виділяє місце перші аргументи та інінціалізує \n";
    cout << " значенням третього аргументу - value); \n";
    cout << " - конструктор копій та операцію присвоєння; !!! \n";
    cout << " - деструктор звільняє пам'ять; \n";
    cout << " - визначити функцію, яка присвоює елементу масиву деяке значення (параметр за замовчуванням); \n";
    cout << " - функцію яка одержує деякий елемент матриці за індексами i та j; \n";
    cout << " - визначити функції друку, додавання, множення на скаляр типу double, віднімання, які здійснюють ці арифметичні операції з \n";
    cout << " даними цього класу; \n";
    cout << " - визначити функції порівняння: більше, менше або рівно, які повертають true або false; \n";
    cout << " - визначити функції порівняння: більше, менше або рівно, які повертають true або false; \n";
    cout << " У змінну стани встановлювати код помилки, коли не вистачає пам'яті, виходить за межі матриці. \n";
    cout << " Передбачити можливість підрахунку числа об'єктів даного типу. Написати програму тестування всіх можливостей цього класу. \n";
    cout << " ============================================================== 4 ============================================================== \n";
    cout << " Закінчити; \n";

    do{
        cout << " Виберіть номер завдання: ";
        cin >> n;

        if (n == 1) n = mainExample1();
        if (n == 2) n = mainExample2();
        if (n == 3) n = mainExample3();
        if (n == 4) return 1;

    } while (n < 1 || n > 4);
}